In [1]:
import pandas as pd
print("HII")

HII

In [2]:
# pandas dataframe
df = pd.DataFrame({"Suraj":[20,19,18], "Shubham":[20,20,19]},index=["Subject1", "Subject2", "Subject3"])

# df["Suraj"][0]
df

          Suraj  Shubham
Subject1     20       20
Subject2     19       20
Subject3     18       19

In [3]:
# pandas series
ds = pd.Series([20, 19, 18], index=["Subject1", "Subject2", "Subject3"], name="Suraj Marks")
ds

Subject1    20
Subject2    19
Subject3    18
Name: Suraj Marks, dtype: int64

In [4]:
# read .csv file
csv_data = pd.read_csv("./sample.csv")

csv_data.shape

csv_data.columns

csv_data.head(5)

,region,anzsic_descriptor,anzsic_descriptor2,category,gas,units,magnitude,year,data_val
0,Auckland,"Forestry and logging, fishing, and agricultura...",Total,Total,Carbon dioxide equivalents,Kilotonnes,Carbon dioxide equivalents,2007,39.43
1,Auckland,"Forestry and logging, fishing, and agricultura...",Total,Total,Carbon dioxide equivalents,Kilotonnes,Carbon dioxide equivalents,2008,40.36
2,Auckland,"Forestry and logging, fishing, and agricultura...",Total,Total,Carbon dioxide equivalents,Kilotonnes,Carbon dioxide equivalents,2009,30.18
3,Auckland,"Forestry and logging, fishing, and agricultura...",Total,Total,Carbon dioxide equivalents,Kilotonnes,Carbon dioxide equivalents,2010,25.66
4,Auckland,"Forestry and logging, fishing, and agricultura...",Total,Total,Carbon dioxide equivalents,Kilotonnes,Carbon dioxide equivalents,2011,42.59

In [5]:
# write data to .csv and read again
obj = {
       "Suraj" : [10,9,8,7],
       "Shubham" : [10, 10, 8, 7],
       "Kiran"  : [5, 6, 10, 8]
      }
df = pd.DataFrame(obj, index=["Sub1", "Sub2", "Sub3", "Sub4"])

df.to_csv("data")

df = pd.read_csv("data",index_col=0)

df

      Suraj  Shubham  Kiran
Sub1     10       10      5
Sub2      9       10      6
Sub3      8        8     10
Sub4      7        7      8

In [6]:
# selecting rows
df = pd.read_csv("sample.csv")
df.head(5)

,region,anzsic_descriptor,anzsic_descriptor2,category,gas,units,magnitude,year,data_val
0,Auckland,"Forestry and logging, fishing, and agricultura...",Total,Total,Carbon dioxide equivalents,Kilotonnes,Carbon dioxide equivalents,2007,39.43
1,Auckland,"Forestry and logging, fishing, and agricultura...",Total,Total,Carbon dioxide equivalents,Kilotonnes,Carbon dioxide equivalents,2008,40.36
2,Auckland,"Forestry and logging, fishing, and agricultura...",Total,Total,Carbon dioxide equivalents,Kilotonnes,Carbon dioxide equivalents,2009,30.18
3,Auckland,"Forestry and logging, fishing, and agricultura...",Total,Total,Carbon dioxide equivalents,Kilotonnes,Carbon dioxide equivalents,2010,25.66
4,Auckland,"Forestry and logging, fishing, and agricultura...",Total,Total,Carbon dioxide equivalents,Kilotonnes,Carbon dioxide equivalents,2011,42.59

In [7]:
print(df.region.head(5))

0    Auckland
1    Auckland
2    Auckland
3    Auckland
4    Auckland
Name: region, dtype: object

In [8]:
df.corr()

             year  data_val
year      1.00000   0.00804
data_val  0.00804   1.00000

In [9]:
obj = {"h" : [1,2,3,4,5,6,7,8,9], "w":[4,8,10,12,11,13,14,16,15]}
df = pd.DataFrame(obj)
df

   h   w
0  1   4
1  2   8
2  3  10
3  4  12
4  5  11
5  6  13
6  7  14
7  8  16
8  9  15

In [10]:
df.corr()

          h         w
h  1.000000  0.938373
w  0.938373  1.000000

In [2]:

import numpy as np

In [10]:
list = [x+1 for x in range(10)]
print(list)
print(list[0::1])

[1, 2, 3, 4, 5, 6, 7, 8, 9, 10]
[1, 2, 3, 4, 5, 6, 7, 8, 9, 10]

In [11]:
arr = np.array([x+1 for x in range(10)])

In [14]:
print(arr)
arr[0::2]

[ 1  2  3  4  5  6  7  8  9 10]

array([1, 3, 5, 7, 9])